Enterprise_Serivces/Cert/SilverGroup2/LoyaltyChannel/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/channel/loyalty/contracts/2010/05/LoyaltyService/GetGameLibrary</wsa:Action><wsa:MessageID>uuid:2d312447-26d0-44b4-9f35-099c779c600e</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://loyaltychannelqa1.testgs.pvt/LoyaltyService.svc</wsa:To></soap:Header><soap:Body><GetGameLibrary xmlns="http://www.gamestop.com/services/channel/loyalty/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/channel/loyalty/messages/2010/05">1276939253</CustomerID></request></GetGameLibrary></soap:Body></soap:Envelope>